In [1]:
# Dependencies and Setup
import pandas as pd

In [6]:
# File to Load 
school_data_to_load ="/Users/mikan/Documents/Data Science Bootcamp/Pandas-challenge/PyCitySchools/schools_complete.csv"
student_data_to_load ="/Users/mikan/Documents/Data Science Bootcamp/Pandas-challenge/PyCitySchools/students_complete.csv"

In [8]:
# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

In [9]:
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [10]:
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [11]:
# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [12]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [22]:
# Calculate the total number of schools
# Select unique school names and save them in a list, schools
schools = school_data_complete["school_name"].unique()
print(schools)
# count the number of items in the list, schools
Total_Schools=len(schools)
print(Total_Schools)

15

In [26]:
# Calculate the total number of students
# Select unique student IDs and save them in a list, students
students=school_data_complete["Student ID"].unique()
# count the number of items in the list, students
Total_Students=len(students)
print(Total_Students)

39170

In [38]:
# Calculate the total budget
# A specific budget for a specific school. So, data needs to be grouped by school
school_group = school_data_complete.groupby(["school_name"])
# One specific budget appears multiple times for a specific school.
# So, budget for min or max is actually the same for a specific scchool (only one budget for every school).
# Use min here to output one budget for each school
school_budget=school_group["budget"].min()
print(school_budget)
# Sum all the budgets
total_budget=sum(school_budget)
print(total_budget)

school_name
Bailey High School       3124928
Cabrera High School      1081356
Figueroa High School     1884411
Ford High School         1763916
Griffin High School       917500
Hernandez High School    3022020
Holden High School        248087
Huang High School        1910635
Johnson High School      3094650
Pena High School          585858
Rodriguez High School    2547363
Shelton High School      1056600
Thomas High School       1043130
Wilson High School       1319574
Wright High School       1049400
Name: budget, dtype: int64
24649428

In [40]:
# Calculate the average math score
avg_math_score=school_data_complete["math_score"].mean()
print(avg_math_score)

78.98537145774827

In [42]:
# Calculate the average reading score
avg_reading_score=school_data_complete["reading_score"].mean()
print(avg_reading_score)

81.87784018381414

In [43]:
# Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2
passing_rate=(avg_math_score + avg_reading_score) / 2
print(passing_rate)

80.43160582078121

In [83]:
# Calculate the percentage of students with a passing math score (70 or greater)
# Select rows with math_score >=70 and keep all the columns 
pass_math=school_data_complete.loc[school_data_complete["math_score"] >=70,:]
pass_math.head()
# Count student ID and calculate %
p_pass_math1=pass_math["Student ID"].count() / Total_Students * 100
print(p_pass_math1)
p_pass_math2=pass_math["Student ID"].count() / Total_Students
print(p_pass_math2)

74.9808526933878
0.749808526933878

In [75]:
# Calculate the percentage of students with a passing reading score (70 or greater)
# Select rows with reading_score >=70 and keep all the columns 
pass_read=school_data_complete.loc[school_data_complete["reading_score"] >=70,:]
pass_read.head()
# Count student ID and calculate %
p_pass_read=pass_read["Student ID"].count() / Total_Students * 100
print(p_pass_read)

85.80546336482001

In [90]:
# Create a dataframe to hold the above results
df=pd.DataFrame({"Total Schools" : [15],
                 "Total Students" : [39170],
                "Total Budget" : [24649428],
                 "Average Math Score" : [78.98537145774827],
                 "Average Reading Score" : [81.87784018381414],
                 "% Passing Math" : [74.9808526933878],
                 "% Passing Reading" : [85.80546336482001],
                 "% Overall Passing Rate" : [80.43160582078121]
                })
df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,80.431606

In [88]:
# reference: https://stackoverflow.com/questions/46677550/python-pandas-converting-numbers-by-comma-separated-for-thousands
tot_stu=df["Total Students"].map('{:,.0f}'.format)
print(tot_stu)
# reference: https://pbpython.com/styling-pandas.html
tot_bud=df["Total Budget"].map('${0:,.2f}'.format)
print(tot_bud)

0    39,170
Name: Total Students, dtype: object
0    $24,649,428.00
Name: Total Budget, dtype: object

In [89]:
# Optional: give the displayed data cleaner formatting
df2=pd.DataFrame({"Total Schools" : [15],
                 "Total Students" : df["Total Students"].map('{:,.0f}'.format),
                "Total Budget" : df["Total Budget"].map('${0:,.2f}'.format),
                 "Average Math Score" : [78.98537145774827],
                 "Average Reading Score" : [81.87784018381414],
                 "% Passing Math" : [74.9808526933878],
                 "% Passing Reading" : [85.80546336482001],
                 "% Overall Passing Rate" : [80.43160582078121]
                })
df2

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing Rate
0,15,"39,170","$24,649,428.00",78.985371,81.87784,74.980853,85.805463,80.431606